
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти
#Область ОбработчикиСобытийЭлементовТаблицыФормыДоходы

&НаКлиенте
Процедура ДоходыПриИзменении(Элемент)

	// Посчитаем итого доходов
	ИтогоДоходов = Объект.Доходы.Итог("СуммаЯнварь") 
		+ Объект.Доходы.Итог("СуммаФевраль") 
		+ Объект.Доходы.Итог("СуммаМарт");
		
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиСобытийЭлементовТаблицыФормыРасходы
&НаКлиенте
Процедура РасходыПриИзменении(Элемент)
	
	// Посчитать итого расходов и выведем ошибку, если они превышают доходы
	ИтогоРасходов = Объект.Расходы.Итог("СуммаЯнварь") 
		+ Объект.Расходы.Итог("СуммаФевраль") 
		+ Объект.Расходы.Итог("СуммаМарт");

	Если ИтогоРасходов > ИтогоДоходов Тогда
		Сообщить("Превышены расходы!");
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти



#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
