
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьДокументыНаСервере();
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ЗаполнитьДокументы(Команда)
	ЗаполнитьДокументыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидАттракциона(Команда)
	УстановитьВидАттракционаНаСервере();
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Заполняет табличную часть "Ремонты" объекта документа на сервере.
//
// Параметры:
//  Нет.
//
&НаСервере
Процедура ЗаполнитьДокументыНаСервере()
	
	// Заполним документы РемонтАттракционов
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РемонтАттракционов.Ссылка КАК Документ,
	|	РемонтАттракционов.Аттракцион КАК Аттракцион,
	|	РемонтАттракционов.ВидАттракциона КАК ВидАттракциона
	|ИЗ
	|	Документ.ГПА_РемонтыАттракционов КАК РемонтАттракционов
	|ГДЕ
	|	НЕ РемонтАттракционов.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Ремонты.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидАттракционаНаСервере()
	
	// Установим Вид аттракциона для каждого документа
	Для Каждого СтрокаТаблицы Из Объект.Ремонты Цикл
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Аттракцион) Тогда
			Продолжить;
		КонецЕсли;
		// Если аттракцион не заполнен, то не будем ничего делать
		ДокументОбъект = СтрокаТаблицы.Документ.ПолучитьОбъект();
		ДокументОбъект.ВидАттракциона = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТаблицы.Аттракцион, "ВидАттракциона");
		ДокументОбъект.Записать();
	КонецЦикла;

КонецПроцедуры
#КонецОбласти

